Revit 2027 API
ControlledApplication.SetLibraryPaths Method
 Sets path information identifying where Revit searches for content.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLibraryPaths(
	IDictionary<string, string> paths
)
Public Sub SetLibraryPaths (
	paths As IDictionary(Of String, String)
)
public:
void SetLibraryPaths(
	IDictionary<String^, String^>^ paths
)
member SetLibraryPaths :
        paths : IDictionary<string, string> -> unit
Parameters
paths IDictionary<String, String>
 The map of library paths.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The map that is returned should contain a key that is purpose of the path, such as Material Libraries and the value in the map is the fully qualified path to be used for that search path.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace